SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_spi.c
/*!
    \file    gd32e23x_hal_spi.c
    \brief   SPI driver
    
    \version 2019-03-14, V1.0.0, firmware for GD32E23x
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32e23x_hal.h"

#define SPI_INIT_MASK                   ((uint32_t)0x00000040U)  /*!< SPI parameter initialization mask */
#define SPI_FIFO_INIT_MASK1             ((uint32_t)0x00000840U)  /*!< SPI1 parameter initialization mask1 */
#define SPI_FIFO_INIT_MASK2             ((uint32_t)0x00000000U)  /*!< SPI1 parameter initialization mask2*/

#define SPI_TIMEOUT_VALUE  200

/* SPI private function */
static void _spi_transmit_interrupt(void *spi);
static void _spi_receive_interrupt(void *spi);
static void _spi_2lines_receive_interrupt(void *spi);
static void _spi_2lines_transmit_interrupt(void *spi);

static void _spi_transmit_compelete_dma(void *dma);
static void _spi_receive_compelete_dma(void *dma);
static void _spi_transmit_receive_compelete_dma(void *dma);
static void _spi_dma_error(void *dma);

static void _spi_stop_receive_interrupt(void *spi);
static void _spi_stop_transmit_interrupt(void *hspi);
static void _spi_close_receive_interrupt(hal_spi_dev_struct *spi);
static void _spi_close_transmit_interrupt(hal_spi_dev_struct *spi);
static void _spi_close_transmit_receive_interrupt(hal_spi_dev_struct *spi);

static int32_t _spi_end_transmit_receive(hal_spi_dev_struct *spi, uint32_t timeout_ms);
static int32_t _spi_end_receive(hal_spi_dev_struct *spi, uint32_t timeout_ms);

static void _spi_clear_error_flag(uint32_t periph ,uint32_t error_flag);

/*!
    \brief      initialize the SPI structure with the default values
    \param[in]  struct_type: refer to hal_spi_struct_type_enum
    \param[in]  p_struct: point to SPI structure that contains the configuration information
    \param[out] none
    \retval     none
*/
void hal_spi_struct_init(hal_spi_struct_type_enum struct_type,void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == p_struct){
        HAL_DEBUGE("parameter [*p_struct] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    switch(struct_type){
    case HAL_SPI_INIT_STRUCT:
         /* initialize SPI initialization structure with the default values */
        ((hal_spi_init_struct*)p_struct)->device_mode = SPI_MASTER ;
        ((hal_spi_init_struct*)p_struct)->trans_mode  = SPI_TRANSMODE_FULLDUPLEX;
        ((hal_spi_init_struct*)p_struct)->frame_size  = SPI_FRAMESIZE_8BIT;
        ((hal_spi_init_struct*)p_struct)->nss         = SPI_NSS_SOFT;
        ((hal_spi_init_struct*)p_struct)->clock_polarity_phase = SPI_CK_PL_LOW_PH_1EDGE;
        ((hal_spi_init_struct*)p_struct)->crc_calculation  = SPI_CRC_DISABLE;
        ((hal_spi_init_struct*)p_struct)->crc_length  = SPI_CRC_8BIT;
        ((hal_spi_init_struct*)p_struct)->crc_poly    = 0x07U;
        ((hal_spi_init_struct*)p_struct)->endian      = SPI_ENDIAN_MSB;
        ((hal_spi_init_struct*)p_struct)->ti_mode     = SPI_TIMODE_DISABLE;
        ((hal_spi_init_struct*)p_struct)->nssp_mode   = SPI_NSSP_DISABLE;
        ((hal_spi_init_struct*)p_struct)->prescale    = SPI_PSC_16;
        break;
    
    case HAL_SPI_DEV_STRUCT:
        /* initialize SPI device information structure with the default values */
        ((hal_spi_dev_struct*)p_struct)->periph = 0;
        ((hal_spi_dev_struct*)p_struct)->spi_irq.error_handler = NULL;
        ((hal_spi_dev_struct*)p_struct)->spi_irq.receive_handler = NULL;
        ((hal_spi_dev_struct*)p_struct)->spi_irq.transmit_handler = NULL;
        ((hal_spi_dev_struct*)p_struct)->p_dma_rx        = NULL;
        ((hal_spi_dev_struct*)p_struct)->p_dma_tx        = NULL;
        ((hal_spi_dev_struct*)p_struct)->txbuffer.buffer = NULL;
        ((hal_spi_dev_struct*)p_struct)->txbuffer.length = 0;
        ((hal_spi_dev_struct*)p_struct)->txbuffer.pos    = 0;
        ((hal_spi_dev_struct*)p_struct)->rxbuffer.buffer = NULL;
        ((hal_spi_dev_struct*)p_struct)->rxbuffer.length = 0;
        ((hal_spi_dev_struct*)p_struct)->rxbuffer.pos    = 0;
        ((hal_spi_dev_struct*)p_struct)->rx_callback     = NULL;
        ((hal_spi_dev_struct*)p_struct)->tx_callback     = NULL;
        ((hal_spi_dev_struct*)p_struct)->tx_rx_callback  = NULL;
        ((hal_spi_dev_struct*)p_struct)->error_callback  = NULL;
        ((hal_spi_dev_struct*)p_struct)->state           = HAL_SPI_STATE_READY;
        ((hal_spi_dev_struct*)p_struct)->error_code      = HAL_SPI_ERROR_NONE;
        break;

    default:
        HAL_DEBUGW("parameter [struct_type] value is undefine");
        break;
    }
    
