SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_spi.c
}

/*!
    \brief      deinitialize SPI
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_spi_deinit(hal_spi_dev_struct *spi)
{
    if((SPI0 == spi->periph) || (SPI1 == spi->periph)){
        spi->state = HAL_SPI_STATE_BUSY;
        spi_i2s_deinit(spi->periph);
        hal_spi_struct_init(HAL_SPI_DEV_STRUCT, spi);
        spi->state = HAL_SPI_STATE_READY;
    }else{
        HAL_DEBUGE("parameter [i2c->periph] value is invalid");
    }  
}

/*!
    \brief      initialize SPI registers
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  periph: SPI peripheral address
    \param[in]  p_init: the initialization data needed to initialize SPI
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_spi_init(hal_spi_dev_struct *spi, uint32_t periph, hal_spi_init_struct *p_init)
{
    uint32_t reg = 0U;
    uint32_t reg1 =0U;
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == spi) || (NULL == p_init)){
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
   
    spi->periph = periph;

    spi->state = HAL_SPI_STATE_BUSY;
    spi_disable(periph);
        
    /* SPI0 init */
    if(SPI0 == periph){
        reg = SPI_CTL0(periph);
        reg &= SPI_INIT_MASK;
        reg1 = SPI_CTL1(periph);
        reg1 &= SPI_FIFO_INIT_MASK2;
        /* frame_size of SPI0 is different to SPI1 */
        reg |= ((p_init->frame_size)&0x00000800);
        reg |= (p_init->device_mode | p_init->crc_calculation | p_init->trans_mode | p_init->nss | p_init->endian | p_init->clock_polarity_phase|p_init->prescale);
        /* write to SPI_CTL0 register */
        SPI_CTL0(periph) = (uint32_t)reg;
        reg1 |= p_init->ti_mode | p_init->nssp_mode;
       
        if((SPI_MASTER ==  p_init->device_mode) && (SPI_NSS_HARD == p_init->nss)){
            reg1 |= SPI_CTL1_NSSDRV;
        }
        /* write to SPI_CTL1 register */
        SPI_CTL1(periph) = (uint32_t)reg1;
        if(SPI_CRC_ENABLE == p_init->crc_calculation){
            spi_crc_polynomial_set(periph,p_init->crc_poly);
        }
    }
    
    /* SPI1 init */
    if(SPI1 == periph){
        reg = SPI_CTL0(periph);
        reg &= SPI_FIFO_INIT_MASK1;
        reg1 = SPI_CTL1(periph);
        reg1 &= SPI_FIFO_INIT_MASK2;
        reg |= (p_init->device_mode | p_init->crc_calculation | p_init->trans_mode | p_init->nss | p_init->endian | p_init->clock_polarity_phase|p_init->prescale);
        /* write to SPI_CTL0 register */
        SPI_CTL0(periph) = (uint32_t)reg;
        reg1 |= (p_init->ti_mode | p_init->nssp_mode | p_init->frame_size);
        if((SPI_MASTER ==  p_init->device_mode) && (SPI_NSS_HARD == p_init->nss)){
            reg1 |= SPI_CTL1_NSSDRV;
        }
        /* write to SPI_CTL1 register */
        SPI_CTL1(periph) = (uint32_t)reg1;
        
        if(p_init->frame_size == SPI_FRAMESIZE_16BIT){
            spi_crc_length_set(periph,SPI_CRC_16BIT);
        }
        if(p_init->frame_size == SPI_FRAMESIZE_8BIT){
            spi_crc_length_set(periph,SPI_CRC_8BIT);
        }
        if(SPI_CRC_ENABLE == p_init->crc_calculation){
            spi_crc_polynomial_set(periph,p_init->crc_poly);
        }
        /* CRC calculation is valid only for 16bit and 8 bit */
        if ((p_init->frame_size != SPI_FRAMESIZE_16BIT) && (p_init->frame_size != SPI_FRAMESIZE_8BIT)){
            /* CRC disable */
            spi_crc_off(spi->periph);
        }
    }

    /* select SPI mode */
    SPI_I2SCTL(periph) &= (uint32_t)(~SPI_I2SCTL_I2SSEL);
    
    spi->state = HAL_SPI_STATE_READY;
    return HAL_ERR_NONE;

}

/*!
    \brief      SPI transmit in polling mode
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_txbuffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL, HAL_ERR_BUSY,HAL_ERR_TIMEOUT details refer to gd32e23x_hal.h 
*/
int32_t hal_spi_transmit_poll(hal_spi_dev_struct *spi, uint8_t *p_txbuffer, uint32_t length, uint32_t timeout_ms)
{
    uint32_t tick_start;

    if (spi->state != HAL_SPI_STATE_READY){
        return HAL_ERR_BUSY;
    }
#if (1 == HAL_PARAMETER_CHECK)
    if (NULL == spi){
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* set the transaction information */
    spi->state = HAL_SPI_STATE_BUSY_TX;
    spi->error_code = HAL_ERR_NONE;
    spi->txbuffer.buffer  = (uint8_t *)p_txbuffer;
    spi->txbuffer.length  = length;
    spi->txbuffer.pos     = length;

    /* init field not used to zero */
    spi->rxbuffer.buffer  = (uint8_t *)NULL;
    spi->rxbuffer.length  = 0U;
    spi->rxbuffer.pos     = 0U;
    spi->tx_callback      = NULL;
    spi->rx_callback      = NULL;

    /* 1 line transmit */
    if((SPI_CTL0(spi->periph)) & (SPI_CTL0_BDEN)){
        SPI_CTL0(spi->periph) |= SPI_CTL0_BDOEN;
    }
    
    if (__HAL_SPI_GET_CRC_USED(spi->periph) == SPI_CRC_ENABLE){
        /* reset CRC */
        spi_crc_off(spi->periph);
        spi_crc_on(spi->periph);
    }
    spi_enable(spi->periph);
    
    if(((__HAL_SPI_GET_SPI1_FRAME_SIZE(spi->periph) > SPI_FRAMESIZE_8BIT)&&(SPI1 == spi->periph))||
        ((__HAL_SPI_GET_SPI0_FRAME_SIZE(spi->periph) == 0x00000800)&&(SPI0 == spi->periph))){
        SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
        if((SPI_SLAVE == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) || (0x01U == spi->txbuffer.pos)){
            
            SPI_DATA(spi->periph) = *((uint16_t *)p_txbuffer);
            p_txbuffer += sizeof(uint16_t);
            spi->txbuffer.pos--;
        }
    
        /* transmit 16 bit data*/
        while(spi->txbuffer.pos > 0U){
            /* wait TBE set */
            tick_start = hal_basetick_count_get();
            while(RESET == spi_i2s_flag_get(spi->periph, SPI_FLAG_TBE)){
                if(HAL_TIMEOUT_FOREVER != timeout_ms){
                    if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                        return HAL_ERR_TIMEOUT;
                    }
                }
            }
            /* transmit data */
            SPI_DATA(spi->periph) = *((uint16_t *)p_txbuffer);
            p_txbuffer += sizeof(uint16_t);
            spi->txbuffer.pos--;
         }

    }else{/* transmit 8 bit data */
        if(SPI1 == spi->periph){
            
            if ((SPI_SLAVE == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) || (0x01U == spi->txbuffer.pos)){
                if (spi->txbuffer.pos > 1U){
                    SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
                    /* packing mode */
                    SPI_DATA(spi->periph) = *((uint16_t *)p_txbuffer);
                    p_txbuffer += sizeof(uint16_t);
                    spi->txbuffer.pos -= 2U;
                }else{
                    SPI_CTL1(spi->periph) |= SPI_CTL1_BYTEN;
                    SPI_DATA(spi->periph) = (*p_txbuffer++);
                    spi->txbuffer.pos--;
                }
            }
            while (spi->txbuffer.pos > 0U){
                SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
                /* wait until TBE is set*/
                tick_start = hal_basetick_count_get();
                while(RESET == spi_i2s_flag_get(spi->periph, SPI_FLAG_TBE)){
                    if(HAL_TIMEOUT_FOREVER != timeout_ms){
                            if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                                return HAL_ERR_TIMEOUT;
                        }
                    }
                }

                if (spi->txbuffer.pos > 1U){
                    SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
                    /* packing mode */
                    SPI_DATA(spi->periph) = *((uint16_t *)p_txbuffer);
                    p_txbuffer += sizeof(uint16_t);
                    spi->txbuffer.pos -= 2U;
                }else{
                    SPI_CTL1(spi->periph) |= SPI_CTL1_BYTEN;
                    SPI_DATA(spi->periph) = (*p_txbuffer++);
                    spi->txbuffer.pos--;
                }
            }
        }
        if(SPI0 == spi->periph){
            if ((SPI_SLAVE == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) || (0x01U == spi->txbuffer.pos)){
                SPI_DATA(spi->periph) = (*p_txbuffer);
                p_txbuffer += sizeof(uint8_t);
                spi->txbuffer.pos--;
            }
            while(spi->txbuffer.pos > 0U){
                /* wait until TBE is set */
                tick_start = hal_basetick_count_get();
                while(RESET == spi_i2s_flag_get(spi->periph, SPI_FLAG_TBE)){
                    if(HAL_TIMEOUT_FOREVER != timeout_ms){
                        if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                                return HAL_ERR_TIMEOUT;
                        }
                    }
                }

                *(__IO uint8_t *)&SPI_DATA(spi->periph) = (*p_txbuffer++);
                spi->txbuffer.pos--;        
            }            
        }
    }
    
    if(__HAL_SPI_GET_CRC_USED(spi->periph) == SPI_CRC_ENABLE){
        /* next data is crc */
        spi_crc_next(spi->periph);
    }

    /* check the end of the transaction */
    if(HAL_ERR_NONE != _spi_end_transmit_receive(spi,SPI_TIMEOUT_VALUE)){
        return HAL_ERR_TIMEOUT ;
    }
    spi->state = HAL_SPI_STATE_READY;
    return HAL_ERR_NONE;
}


/*!
    \brief      SPI receive in polling mode
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_rxbuffer: pointer to rxbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_BUSY details refer to gd32e23x_hal.h 
*/
int32_t hal_spi_receive_poll(hal_spi_dev_struct *spi, uint8_t *p_rxbuffer,uint32_t length, uint32_t timeout_ms)
{
    __IO uint16_t tmp_crc = 0U;
    uint32_t tick_start = 0;
    if ((SPI_MASTER == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) && (SPI_TRANSMODE_FULLDUPLEX == __HAL_SPI_GET_TRANS_MODE(spi->periph))){
        spi->state = HAL_SPI_STATE_BUSY_RX;
        /* call transmit-receive function to send dummy data generate clock */
        return hal_spi_transmit_receive_poll(spi, p_rxbuffer, p_rxbuffer, length, timeout_ms);
    }    

