SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_spi.c
    if (HAL_SPI_STATE_READY != spi->state){
        return HAL_ERR_BUSY;
    }
#if (1 == HAL_PARAMETER_CHECK)
    if (NULL == spi){
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    spi->state            = HAL_SPI_STATE_BUSY_RX;
    spi->error_code       = HAL_ERR_NONE;
    /* init field not used to zero */
    spi->txbuffer.buffer  = (uint8_t *)NULL;
    spi->txbuffer.length  = 0;
    spi->txbuffer.pos     = 0;
    spi->tx_callback      = NULL;
    spi->rx_callback      = NULL;
    spi->tx_rx_callback   = NULL;
    spi->error_callback   = NULL;
    /* set the receiver information */
    spi->rxbuffer.buffer  = (uint8_t *)p_rxbuffer;
    spi->rxbuffer.length  = length;
    spi->rxbuffer.pos     = length;

    /* 1 line receive */
    if((SPI_CTL0(spi->periph)) & (SPI_CTL0_BDEN)){
        SPI_CTL0(spi->periph) &= ~SPI_CTL0_BDOEN;
    }
    
    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)){
        /* reset CRC */
        spi_crc_off(spi->periph);
        spi_crc_on(spi->periph);
        /* set crc next bit before the latest data */
        spi->rxbuffer.pos--;
    }
    /* half-word access SPI data register */
    if(SPI1 == spi->periph){
        SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
    }

    spi_enable(spi->periph);

    /* receive 8 bit data */
    if(((__HAL_SPI_GET_SPI1_FRAME_SIZE(spi->periph) <= SPI_FRAMESIZE_8BIT)&&(SPI1 == spi->periph))||((__HAL_SPI_GET_SPI0_FRAME_SIZE(spi->periph) == 0x00000000)&&(SPI0 == spi->periph))){
        SPI_CTL1(spi->periph) |= SPI_CTL1_BYTEN;
        while (spi->rxbuffer.pos > 0U){
            /* wait uintl RBNE is set */
            tick_start = hal_basetick_count_get();
            while(RESET == spi_i2s_flag_get(spi->periph, SPI_FLAG_RBNE)){
                if(HAL_TIMEOUT_FOREVER != timeout_ms){
                    if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                        return HAL_ERR_TIMEOUT;
                    }
                }
            }
            (*(uint8_t *)p_rxbuffer++) = SPI_DATA(spi->periph);
            spi->rxbuffer.pos--;

        }
    }else{/* receive 16 bit data */
        SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
        while (spi->rxbuffer.pos > 0U){
            /* wait uintl RBNE is set */
            tick_start = hal_basetick_count_get();
            while(RESET == spi_i2s_flag_get(spi->periph, SPI_FLAG_RBNE)){
                if(HAL_TIMEOUT_FOREVER != timeout_ms){
                    if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                        return HAL_ERR_TIMEOUT;
                    }
                }
            }

            /* receive data */
            (*(uint16_t *)p_rxbuffer)= SPI_DATA(spi->periph);
            p_rxbuffer += sizeof(uint16_t);
            spi->rxbuffer.pos--;    
        }
    }

    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)){
      
            spi_crc_next(spi->periph);
            /* wait until RBNE is set */
            tick_start = hal_basetick_count_get();
            while(RESET == spi_i2s_flag_get(spi->periph, SPI_FLAG_RBNE)){
                if(HAL_TIMEOUT_FOREVER != timeout_ms){
                    if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                        return HAL_ERR_TIMEOUT;
                    }
                }
            }

            /* receive last data */
            if(SPI0 == spi->periph){
                if (__HAL_SPI_GET_SPI0_FRAME_SIZE(spi->periph) > SPI_FRAMESIZE_8BIT){
                    *((uint16_t *)p_rxbuffer) = SPI_DATA(spi->periph);
                }else{
                    (*(uint8_t *)p_rxbuffer) = *(__IO uint8_t *)&SPI_DATA(spi->periph);
                }
            }
            if(SPI1 == spi->periph){
                if (__HAL_SPI_GET_SPI1_FRAME_SIZE(spi->periph) > SPI_FRAMESIZE_8BIT){
                    SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
                    *((uint16_t *)p_rxbuffer) = SPI_DATA(spi->periph);
                }else{
                     SPI_CTL1(spi->periph) |= SPI_CTL1_BYTEN;
                    (*(uint8_t *)p_rxbuffer) = SPI_DATA(spi->periph);
                }
            }
            /* wait until RBNE is set */
            tick_start = hal_basetick_count_get();
            while(RESET == spi_i2s_flag_get(spi->periph, SPI_FLAG_RBNE)){
                if(HAL_TIMEOUT_FOREVER != timeout_ms){
                    if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                        return HAL_ERR_TIMEOUT;
                    }
                }
            }

            tmp_crc = SPI_DATA(spi->periph);
        if(SET == spi_i2s_flag_get(spi->periph,SPI_FLAG_CRCERR)){
            _spi_clear_error_flag(spi->periph,SPI_ERROR_FLAG_CRCERR);
            spi->state = HAL_SPI_STATE_READY;
            return HAL_ERR_HARDWARE;
        }
    }
    /* check the end of the transaction */
    if(HAL_ERR_NONE != _spi_end_transmit_receive(spi,SPI_TIMEOUT_VALUE)){
        spi->state = HAL_SPI_STATE_READY;
        return HAL_ERR_TIMEOUT;
    }

    spi->state = HAL_SPI_STATE_READY;
    return HAL_ERR_NONE;
    
}

/*!
    \brief      SPI transmit and receive in polling mode
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_txbuffer: pointer to txbuffer 
    \param[in]  p_rxbuffer: pointer to rxbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h 
*/
int32_t hal_spi_transmit_receive_poll(hal_spi_dev_struct *spi, uint8_t *p_txbuffer, uint8_t *p_rxbuffer, uint32_t length, uint32_t timeout_ms)
{
    /* alternate Rx and Tx during transfer */
    uint32_t tx_flag = 1U;
    __IO uint16_t tmp_crc = 0U;
    uint32_t tick_start = 0;
    if (HAL_SPI_STATE_READY != spi->state){
        return HAL_ERR_BUSY;
    }
#if (1 == HAL_PARAMETER_CHECK)
    if (NULL == spi){
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

