SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_spi.c
    /* set transmit information */
    spi->state            = HAL_SPI_STATE_BUSY_TX_RX;
    spi->error_code        = HAL_ERR_NONE;
    spi->txbuffer.buffer  = (uint8_t *)p_txbuffer;
    spi->txbuffer.length  = length;
    spi->txbuffer.pos     = length;

    /* set receive information*/
    spi->rxbuffer.buffer  = (uint8_t *)p_rxbuffer;
    spi->rxbuffer.length  = length;
    spi->rxbuffer.pos     = length;
    
    spi->tx_callback      = NULL;
    spi->rx_callback      = NULL;

    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)){
        /* reset CRC */
        spi_crc_off(spi->periph);
        spi_crc_on(spi->periph);
    }

    if(SPI1 == spi->periph){
        SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
    }
    
    spi_enable(spi->periph);

    /* transmit and receive 16 bit data */
    if(((__HAL_SPI_GET_SPI1_FRAME_SIZE(spi->periph) > SPI_FRAMESIZE_8BIT)&&(SPI1 == spi->periph))||((__HAL_SPI_GET_SPI0_FRAME_SIZE(spi->periph) == 0x00000800)&&(SPI0 == spi->periph))){
        if ((SPI_SLAVE == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) || (0x01U == spi->txbuffer.pos)){
            SPI_DATA(spi->periph) = *((uint16_t *)p_txbuffer);
            p_txbuffer += sizeof(uint16_t);
            spi->txbuffer.pos--;
        } 
        
        while (spi->txbuffer.pos > 0U || spi->rxbuffer.pos > 0U){
            if (tx_flag && (spi->txbuffer.pos > 0U)){
                tick_start = hal_basetick_count_get();
                while(RESET == spi_i2s_flag_get(spi->periph, SPI_FLAG_TBE)){
                    if(HAL_TIMEOUT_FOREVER != timeout_ms){
                        if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                            return HAL_ERR_TIMEOUT;
                        }
                    }
                }

                SPI_DATA(spi->periph) = *((uint16_t *)p_txbuffer);
                p_txbuffer += sizeof(uint16_t);
                spi->txbuffer.pos--;
                tx_flag = 0U;

                /* enable CRC transmission */
                if ((0U == spi->txbuffer.pos) && (SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph))){
                    spi_crc_next(spi->periph);
                }
            }
            /* check RBNE flag */
            if ((spi->rxbuffer.pos > 0U)){
                tick_start = hal_basetick_count_get();
                while(RESET == spi_i2s_flag_get(spi->periph, SPI_FLAG_RBNE)){
                    if(HAL_TIMEOUT_FOREVER != timeout_ms){
                        if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                            return HAL_ERR_TIMEOUT;
                        }
                    }
                }
                *((uint16_t *)p_rxbuffer) = SPI_DATA(spi->periph);
                p_rxbuffer += sizeof(uint16_t);
                spi->rxbuffer.pos--;
                /* next data is a transmission */
                tx_flag = 1U;
            }
        }
     }else{ /* transmit and receive 8 bit data */
        if(SPI1 == spi->periph){
            if((SPI_SLAVE == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) || (0x01U == spi->txbuffer.pos)){
                if (spi->txbuffer.pos > 1U){
                    SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
                    /* packing mode */
                    SPI_DATA(spi->periph) = *((uint16_t *)p_txbuffer);
                    p_txbuffer += sizeof(uint16_t);
                    spi->txbuffer.pos -= 2U;
                }else{
                    SPI_CTL1(spi->periph) |= SPI_CTL1_BYTEN;
                    SPI_DATA(spi->periph) = (*p_txbuffer++);
                    spi->txbuffer.pos--;
                    SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
                }
            }
            while (spi->txbuffer.pos > 0U || spi->rxbuffer.pos > 0U){
                if (tx_flag && (spi->txbuffer.pos > 0U)){
                    /* wait until TBE is set */
                    tick_start = hal_basetick_count_get();
                    while(RESET == spi_i2s_flag_get(spi->periph, SPI_FLAG_TBE)){
                        if(HAL_TIMEOUT_FOREVER != timeout_ms){
                            if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                                return HAL_ERR_TIMEOUT;
                            }
                        }
                    }

                    if(spi->txbuffer.pos > 1U){
                        SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
                        /* packing mode */
                        SPI_DATA(spi->periph) = *((uint16_t *)p_txbuffer);
                        p_txbuffer += sizeof(uint16_t);
                        spi->txbuffer.pos -= 2U;

                    }else{
                        SPI_CTL1(spi->periph) |= SPI_CTL1_BYTEN;
                        SPI_DATA(spi->periph) = (*p_txbuffer++);
                        spi->txbuffer.pos--;
                    }
                    /* next data is a reception */
                    tx_flag = 0U; 

                }
                    if ((spi->txbuffer.pos == 0U) && (SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph))){
                        spi_crc_next(spi->periph);
                    }
                if (spi->rxbuffer.pos > 0U){
                    tick_start = hal_basetick_count_get();
                    /* wait until RBNE is set */
                    while(RESET == spi_i2s_flag_get(spi->periph, SPI_FLAG_RBNE)){
                        if(HAL_TIMEOUT_FOREVER != timeout_ms){
                            if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                                return HAL_ERR_TIMEOUT;
                            }
                        }
                    }

                    if (spi->rxbuffer.pos > 1U){
                         SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
                        /* packing mode */
                        *((uint16_t *)p_rxbuffer) =SPI_DATA(spi->periph) ;
                        p_rxbuffer += sizeof(uint16_t);
                        spi->rxbuffer.pos -= 2U;

                    }else{
                        SPI_CTL1(spi->periph) |= SPI_CTL1_BYTEN;
                        (*p_rxbuffer++) = SPI_DATA(spi->periph);
                        spi->rxbuffer.pos--;
                    }
                    tx_flag = 1U;
                }
            }
        }
        if(SPI0 == spi->periph){
            if ((SPI_SLAVE == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) || (0x01U == spi->txbuffer.pos)){
                SPI_DATA(spi->periph) = (*p_txbuffer);
                p_txbuffer += sizeof(uint8_t);
                spi->txbuffer.pos--;
             }
            while(spi->txbuffer.pos > 0U || spi->rxbuffer.pos > 0U){
                if(tx_flag && (spi->txbuffer.pos > 0U)){
                     tick_start = hal_basetick_count_get();
                     /* wait until TBE is set */
                     while(RESET == spi_i2s_flag_get(spi->periph, SPI_FLAG_TBE)){
                         if(HAL_TIMEOUT_FOREVER != timeout_ms){
                             if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                                  return HAL_ERR_TIMEOUT;
                             }
                         }
                     }

                    *(__IO uint8_t *)&SPI_DATA(spi->periph) = (*p_txbuffer++);
                    spi->txbuffer.pos--;
                    tx_flag = 0U;
                
