SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_spi.c
                }
                if((spi->txbuffer.pos == 0U) && (SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph))){
                    spi_crc_next(spi->periph);
                }
                if(spi->rxbuffer.pos > 0U){
                    tick_start = hal_basetick_count_get();
                    while(RESET == spi_i2s_flag_get(spi->periph, SPI_FLAG_RBNE)){
                        if(HAL_TIMEOUT_FOREVER != timeout_ms){
                            if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                                return HAL_ERR_TIMEOUT;
                            }
                        }
                    }

                    (*(uint8_t *)p_rxbuffer++) = SPI_DATA(spi->periph);
                    spi->rxbuffer.pos--;
                    tx_flag = 1U;
                }
            }
        }
    }

    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)){
        while(RESET == spi_i2s_flag_get(spi->periph, SPI_FLAG_RBNE)){
            tick_start = hal_basetick_count_get();
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    spi->state = HAL_SPI_STATE_READY;
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
        tmp_crc = SPI_DATA(spi->periph);
        if(SET == spi_i2s_flag_get(spi->periph,SPI_FLAG_CRCERR)){
            _spi_clear_error_flag(spi->periph,SPI_ERROR_FLAG_CRCERR);
            spi->state = HAL_SPI_STATE_READY;
            return HAL_ERR_HARDWARE;
        }
    }

    /* check the end of the transaction */
    if(HAL_ERR_NONE != _spi_end_transmit_receive(spi,SPI_TIMEOUT_VALUE)){
        spi->state = HAL_SPI_STATE_READY;
        return HAL_ERR_TIMEOUT ;
    }
    spi->state = HAL_SPI_STATE_READY;
    return HAL_ERR_NONE;
}

/*!
    \brief      SPI transmit in interrupt mode
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_txbuffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h 
*/
int32_t hal_spi_transmit_interrupt(hal_spi_dev_struct *spi, uint8_t *p_txbuffer, uint32_t length, hal_spi_user_callback_struct *p_user_func)
{
    if (HAL_SPI_STATE_READY != spi->state){
        return HAL_ERR_BUSY;
    }
#if (1 == HAL_PARAMETER_CHECK)
    if (NULL == spi){
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* set the transmit information */
    spi->state = HAL_SPI_STATE_BUSY_TX;
    spi->error_code = HAL_SPI_ERROR_NONE;
    spi->txbuffer.buffer = (uint8_t *)p_txbuffer;
    spi->txbuffer.length = length;
    spi->txbuffer.pos = length;

    /* init field not used to zero */
    spi->rxbuffer.buffer  = (uint8_t *)NULL;
    spi->rxbuffer.length  = 0U;
    spi->rxbuffer.pos = 0U;
    
    spi->rx_callback = NULL;
    spi->tx_rx_callback = NULL;
    spi->tx_callback = (void *)p_user_func->complete_func;
    spi->error_callback = (void *)p_user_func->error_func;
    
    spi->spi_irq.transmit_handler = _spi_transmit_interrupt;

    if((SPI_CTL0(spi->periph)) & (SPI_CTL0_BDEN)){
        SPI_CTL0(spi->periph) |= SPI_CTL0_BDOEN;
    }
    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)){
        spi_crc_off(spi->periph);
        spi_crc_on(spi->periph);
    }

    if(SPI1 == spi->periph){
        SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
    }
    /* enable TBE and ERR interrupt */
    spi_i2s_interrupt_enable(spi->periph,SPI_I2S_INT_TBE);
    spi_i2s_interrupt_enable(spi->periph,SPI_I2S_INT_ERR);

    spi_enable(spi->periph);

    return HAL_ERR_NONE;    
}

/*!
    \brief      SPI receive in interrupt mode
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_rxbuffer: pointer to rxbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h 
*/
int32_t hal_spi_receive_interrupt(hal_spi_dev_struct *spi, uint8_t *p_rxbuffer, uint32_t length, hal_spi_user_callback_struct *p_user_func)
{
    
    if ((SPI_MASTER == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) && (SPI_TRANSMODE_FULLDUPLEX == __HAL_SPI_GET_TRANS_MODE(spi->periph))){
        spi->state = HAL_SPI_STATE_BUSY_RX;
        /* call transmit-receive function to send dummy data generate clock */
        return hal_spi_transmit_receive_interrupt(spi, p_rxbuffer, p_rxbuffer, length, p_user_func);
    }    

    if (HAL_SPI_STATE_READY != spi->state){
        return HAL_ERR_BUSY;
    }
#if (1 == HAL_PARAMETER_CHECK)
    if (NULL == spi | 0U == length){
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    spi->state = HAL_SPI_STATE_BUSY_RX;
    /* init field not used to zero */
    spi->txbuffer.buffer = (uint8_t *)NULL;
    spi->txbuffer.length = 0;
    spi->txbuffer.pos = 0;
    
    /* set the receiption information */
    spi->rxbuffer.buffer = (uint8_t *)p_rxbuffer;
    spi->rxbuffer.length = length;
    spi->rxbuffer.pos = length;
    
    spi->tx_callback = NULL;        
    spi->rx_callback = (void *)p_user_func->complete_func;
    spi->error_callback = (void *)p_user_func->error_func;

    spi->spi_irq.receive_handler = _spi_receive_interrupt;

    if((SPI_CTL0(spi->periph)) & (SPI_CTL0_BDEN)){
        SPI_CTL0(spi->periph) &= ~SPI_CTL0_BDOEN;
    }
    
    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)){
        spi->crc_size = 1U;
        spi_crc_off(spi->periph);
        spi_crc_on(spi->periph);
    }else{
        spi->crc_size = 0U;
    }

    if(SPI1 == spi->periph){
        SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
    }
    /* enable RBNE and ERR interrupt */
    spi_i2s_interrupt_enable(spi->periph,SPI_I2S_INT_RBNE);
    spi_i2s_interrupt_enable(spi->periph,SPI_I2S_INT_ERR);

