SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_spi.c
    spi_enable(spi->periph);

    return HAL_ERR_NONE;
}

/*!
    \brief      SPI transmit and receive in interrupt mode
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_txbuffer: pointer to txbuffer 
    \param[in]  p_rxbuffer: pointer to rxbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h 
*/
int32_t hal_spi_transmit_receive_interrupt(hal_spi_dev_struct *spi, uint8_t *p_txbuffer, uint8_t *p_rxbuffer,uint32_t length, hal_spi_user_callback_struct *p_user_func)
{

    if (spi->state != HAL_SPI_STATE_READY){
        return HAL_ERR_BUSY;
    }
#if (1 == HAL_PARAMETER_CHECK)
    if (NULL == spi | 0U == length){
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    spi_disable(spi->periph);
    /* set transmit information */
    spi->state       = HAL_SPI_STATE_BUSY_TX_RX;
    spi->txbuffer.buffer  = (uint8_t *)p_txbuffer;
    spi->txbuffer.length  = length;
    spi->txbuffer.pos = length;

    /* set receiption information */
    spi->rxbuffer.buffer  = (uint8_t *)p_rxbuffer;
    spi->rxbuffer.length  = length;
    spi->rxbuffer.pos     = length;

    spi->tx_callback = NULL;
    spi->rx_callback = NULL;
    spi->tx_rx_callback = (void *)p_user_func->complete_func;
    spi->error_callback = (void *)p_user_func->error_func;

    spi->spi_irq.receive_handler = _spi_2lines_receive_interrupt;
    spi->spi_irq.transmit_handler = _spi_2lines_transmit_interrupt;

    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)){
        spi->crc_size = 1U;
        spi_crc_off(spi->periph);
        spi_crc_on(spi->periph);
    }else{
        spi->crc_size = 0U;
    }

    if(SPI1 == spi->periph){
        SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
    }
    /* enable TBE, RBNE and ERR interrupt */
    spi_i2s_interrupt_enable(spi->periph,SPI_I2S_INT_TBE);
    spi_i2s_interrupt_enable(spi->periph,SPI_I2S_INT_RBNE);
    spi_i2s_interrupt_enable(spi->periph,SPI_I2S_INT_ERR);

    spi_enable(spi->periph);

    return HAL_ERR_NONE;
    
}

/*!
    \brief      SPI transmit in DMA mode
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_txbuffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_BUSY, HAL_ERR_VAL details refer to gd32e23x_hal.h 
*/
int32_t hal_spi_transmit_dma(hal_spi_dev_struct *spi, uint8_t *p_txbuffer, uint32_t length, hal_spi_user_callback_struct *p_user_func)
{
    uint32_t dma_memory_width_temp=0;
    hal_dma_irq_struct dma_irq;
    
    if (spi->state != HAL_SPI_STATE_READY){
        return HAL_ERR_BUSY;
    }
#if (1 == HAL_PARAMETER_CHECK)
    if ((NULL == spi) || (0U == length)){
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* set the transaction information */
    spi->state = HAL_SPI_STATE_BUSY_TX;
    spi->txbuffer.buffer = (uint8_t *)p_txbuffer;
    spi->txbuffer.length = length;
    spi->txbuffer.pos = length;
    
    /* Init field not used to zero */
    spi->rxbuffer.buffer = (uint8_t *)NULL;
    spi->rxbuffer.length = 0U;
    spi->rxbuffer.pos = 0U;
    spi->rx_callback = NULL;
    spi->tx_callback = (void *)p_user_func->complete_func;
    spi->error_callback = (void *)p_user_func->error_func;
       
    /* 1 lines transmit */
    if((SPI_CTL0(spi->periph)) & (SPI_CTL0_BDEN)){
        SPI_CTL0(spi->periph) |= SPI_CTL0_BDOEN;
    }
    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)){
        /* reset CRC */
        spi_crc_off(spi->periph);
        spi_crc_on(spi->periph);
    }
    spi->p_dma_tx->dma_irq.half_finish_handle = NULL;
    spi->p_dma_tx->dma_irq.full_finish_handle = _spi_transmit_compelete_dma;
    spi->p_dma_tx->dma_irq.error_handle = _spi_dma_error;

    
    if(SPI1 == spi->periph){
         SPI_CTL1(spi->periph) &= (uint32_t)(~SPI_CTL1_TXDMA_ODD);
        /* packing mode is enabled only if the DMA setting is HALFWORD */
        if (__HAL_SPI_GET_SPI1_FRAME_SIZE(spi->periph) > SPI_FRAMESIZE_8BIT){
            SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
        }else{
            SPI_CTL1(spi->periph) |= SPI_CTL1_BYTEN;
            dma_memory_width_temp = DMA_CHCTL(spi->p_dma_tx->channel)&(DMA_CHXCTL_MWIDTH);
            if (DMA_MEMORY_WIDTH_16BIT == dma_memory_width_temp){
                SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
                if (0U == (spi->txbuffer.length & 0x1U)){
                    SPI_CTL1(spi->periph) &= (uint32_t)(~SPI_CTL1_TXDMA_ODD);
                    spi->txbuffer.pos = (spi->txbuffer.pos >> 1U);
                }else{
                    SPI_CTL1(spi->periph) |= (uint32_t)SPI_CTL1_TXDMA_ODD;
                    spi->txbuffer.pos = (spi->txbuffer.pos >> 1U) + 1U;
                }
            }
        }
    }
    dma_irq.half_finish_handle = NULL;
    dma_irq.full_finish_handle = _spi_transmit_compelete_dma;
    dma_irq.error_handle = _spi_dma_error;
    
    hal_dma_start_interrupt(spi->p_dma_tx,(uint32_t)spi->txbuffer.buffer, (uint32_t)&SPI_DATA(spi->periph), spi->txbuffer.pos, &dma_irq);
    spi_i2s_interrupt_enable(spi->periph,SPI_I2S_INT_ERR);
    spi_enable(spi->periph);

    /* enable SPI DMA transmit */
    spi_dma_enable(spi->periph, SPI_DMA_TRANSMIT);

    return HAL_ERR_NONE;
}

/*!
    \brief      SPI receive in DMA mode
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_rxbuffer: pointer to rxbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h 
*/
int32_t hal_spi_receive_dma(hal_spi_dev_struct *spi, uint8_t *p_rxbuffer, uint32_t length, hal_spi_user_callback_struct *p_user_func)
{
    uint32_t dma_memory_width_temp=0;
    hal_dma_irq_struct dma_irq;

