SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_spi.c
    if ((SPI_MASTER == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) && (SPI_TRANSMODE_FULLDUPLEX == __HAL_SPI_GET_DEVICE_MODE(spi->periph))){
        spi->state = HAL_SPI_STATE_BUSY_RX;
        /* call transmit-receive function to send dummy data generate clock on CLK line */
        return hal_spi_transmit_receive_dma(spi, p_rxbuffer, p_rxbuffer, length, p_user_func);
    }    

    if (spi->state != HAL_SPI_STATE_READY){
         return HAL_ERR_BUSY;
    }
#if (1 == HAL_PARAMETER_CHECK)
    if (NULL == spi){
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    spi->state = HAL_SPI_STATE_BUSY_RX;
    spi->error_code = HAL_ERR_NONE;
    spi->txbuffer.buffer  = (uint8_t *)NULL;
    spi->txbuffer.length  = 0;
    spi->txbuffer.pos = 0;

    /* set the receive information */
    spi->rxbuffer.buffer  = (uint8_t *)p_rxbuffer;
    spi->rxbuffer.length  = length;
    spi->rxbuffer.pos     = length;
    
    spi->rx_callback = (void *)p_user_func->complete_func;
    spi->error_callback = (void *)p_user_func->error_func;
    spi->tx_callback = NULL;
    
    /* 1 line receive */
    if((SPI_CTL0(spi->periph)) & (SPI_CTL0_BDEN)){
        SPI_CTL0(spi->periph) &= ~SPI_CTL0_BDOEN;
    }
    /* DMA receive complete callback */
    spi->p_dma_rx->dma_irq.half_finish_handle = NULL;
    spi->p_dma_rx->dma_irq.full_finish_handle = _spi_receive_compelete_dma;
    spi->p_dma_rx->dma_irq.error_handle = _spi_dma_error;
    
    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)){
        /* reset CRC */
        spi_crc_off(spi->periph);
        spi_crc_on(spi->periph);
    }

    if(SPI1 == spi->periph){
        /* packing mode is enabled only if the DMA setting is DMA_MEMORY_WIDTH_16BIT */
        dma_memory_width_temp = DMA_CHCTL(spi->p_dma_rx->channel)&(DMA_CHXCTL_MWIDTH);
        
        SPI_CTL1(spi->periph) &= (uint32_t)(~SPI_CTL1_TXDMA_ODD);
       
        if((__HAL_SPI_GET_SPI1_FRAME_SIZE(spi->periph) > SPI_FRAMESIZE_8BIT)){
        
            SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;

        }else{
            SPI_CTL1(spi->periph) |= SPI_CTL1_BYTEN;
            if(DMA_MEMORY_WIDTH_16BIT == dma_memory_width_temp){
                SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
                if (0U == (spi->rxbuffer.length & 0x1U)){
                    SPI_CTL1(spi->periph) &= (uint32_t)(~SPI_CTL1_RXDMA_ODD);
                    spi->rxbuffer.pos = (spi->rxbuffer.pos >> 1U);
                }else{
                    SPI_CTL1(spi->periph) |= (uint32_t)SPI_CTL1_RXDMA_ODD;
                    spi->rxbuffer.pos = (spi->rxbuffer.pos >> 1U) + 1U;
                }
            }
        }
    }
    
    spi->tx_callback = NULL;
    spi->tx_rx_callback = NULL;
    spi->rx_callback = (void *)p_user_func->complete_func;
    spi->error_callback = (void *)p_user_func->error_func;
    
    /* DMA receive complete callback */
    dma_irq.half_finish_handle = NULL;
    dma_irq.full_finish_handle = _spi_receive_compelete_dma;
    dma_irq.error_handle = _spi_dma_error;
    
    hal_dma_start_interrupt(spi->p_dma_rx, (uint32_t)&SPI_DATA(spi->periph) ,(uint32_t)spi->rxbuffer.buffer, spi->rxbuffer.pos, &dma_irq);

    spi_enable(spi->periph);

    spi_i2s_interrupt_enable(spi->periph,SPI_I2S_INT_ERR);

    /* enable SPI DMA receive */
    spi_dma_enable(spi->periph, SPI_DMA_RECEIVE);

    return HAL_ERR_NONE;
}

/*!
    \brief      SPI transmit and receive in DMA mode
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_txbuffer: pointer to txbuffer 
    \param[in]  p_rxbuffer: pointer to rxbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h 
*/
int32_t hal_spi_transmit_receive_dma(hal_spi_dev_struct *spi, uint8_t *p_txbuffer,uint8_t *p_rxbuffer,uint32_t length, hal_spi_user_callback_struct *p_user_func)
{

    uint32_t dma_memory_width_temp=0;
    hal_dma_irq_struct dma_irq;

    
    if (HAL_SPI_STATE_READY != spi->state){
        return HAL_ERR_BUSY;
    }
#if (1 == HAL_PARAMETER_CHECK)
    if ((NULL == spi) || (0U == length)){
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* set the transaction information */
    spi->state = HAL_SPI_STATE_BUSY_TX_RX;
    spi->txbuffer.buffer  = (uint8_t *)p_txbuffer;
    spi->txbuffer.length  = length;
    spi->txbuffer.pos = length;
    
    /* set the reception information */
    spi->rxbuffer.buffer = (uint8_t *)p_rxbuffer;
    spi->rxbuffer.length = length;
    spi->rxbuffer.pos = length;
    
    spi->tx_rx_callback = (void *)p_user_func->complete_func;
    spi->error_callback = (void *)p_user_func->error_func;

    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)){
        /* reset CRC */
        spi_crc_off(spi->periph);
        spi_crc_on(spi->periph);
    }
    
    spi->p_dma_tx->dma_irq.half_finish_handle = NULL;
    spi->p_dma_tx->dma_irq.full_finish_handle = NULL;
    spi->p_dma_tx->dma_irq.error_handle = NULL;
    
    spi->p_dma_rx->dma_irq.half_finish_handle = NULL;
    spi->p_dma_rx->dma_irq.full_finish_handle = _spi_transmit_receive_compelete_dma;
    spi->p_dma_rx->dma_irq.error_handle = _spi_dma_error;

    if(SPI1 == spi->periph){
        SPI_CTL1(spi->periph) &= (uint32_t)(~SPI_CTL1_TXDMA_ODD);
        SPI_CTL1(spi->periph) &= (uint32_t)(~SPI_CTL1_RXDMA_ODD);
        if (__HAL_SPI_GET_SPI1_FRAME_SIZE(spi->periph) > SPI_FRAMESIZE_8BIT){
            SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
        }else{
            SPI_CTL1(spi->periph) |= SPI_CTL1_BYTEN;
            dma_memory_width_temp = DMA_CHCTL(spi->p_dma_tx->channel)&(DMA_CHXCTL_MWIDTH);
            if (DMA_MEMORY_WIDTH_16BIT == dma_memory_width_temp){
                SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
                if (0U == (spi->txbuffer.length & 0x1U)){
                    SPI_CTL1(spi->periph) &= (uint32_t)(~SPI_CTL1_TXDMA_ODD);
                    spi->txbuffer.pos = (spi->txbuffer.pos >> 1U);
                }else{
                    SPI_CTL1(spi->periph) |= (uint32_t)SPI_CTL1_TXDMA_ODD;
                    spi->txbuffer.pos = (spi->txbuffer.pos >> 1U) + 1U;
                }
            }
            dma_memory_width_temp = DMA_CHCTL(spi->p_dma_rx->channel)&(DMA_CHXCTL_MWIDTH);
            if(DMA_MEMORY_WIDTH_16BIT == dma_memory_width_temp){
                SPI_CTL1(spi->periph) &= ~SPI_CTL1_BYTEN;
                if(0U == (spi->rxbuffer.length & 0x1U)){
                    SPI_CTL1(spi->periph) &= (uint32_t)(~SPI_CTL1_RXDMA_ODD);
                    spi->rxbuffer.pos = (spi->rxbuffer.pos >> 1U);
                }else{
                    SPI_CTL1(spi->periph) |= (uint32_t)SPI_CTL1_RXDMA_ODD;
                    spi->rxbuffer.pos = (spi->rxbuffer.pos >> 1U) + 1U;
                }
            }
        }
    }

    dma_irq.half_finish_handle = NULL;
    if(HAL_SPI_STATE_BUSY_RX == spi->state){
        dma_irq.full_finish_handle = _spi_receive_compelete_dma;
    }else{
        dma_irq.full_finish_handle = _spi_transmit_receive_compelete_dma;
    }

