SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_spi.c
    dma_irq.error_handle = _spi_dma_error;
    
    hal_dma_start_interrupt(spi->p_dma_rx, (uint32_t)&SPI_DATA(spi->periph),(uint32_t)spi->rxbuffer.buffer, spi->rxbuffer.pos, &dma_irq);
    /* enable SPI DMA receive */
    spi_dma_enable(spi->periph, SPI_DMA_RECEIVE);

    hal_dma_start_interrupt(spi->p_dma_tx,(uint32_t)spi->txbuffer.buffer, (uint32_t)&SPI_DATA(spi->periph), spi->txbuffer.pos, &dma_irq);

    spi_enable(spi->periph);
    spi_i2s_interrupt_enable(spi->periph,SPI_I2S_INT_ERR);
    /* enable SPI DMA transmit */
    spi_dma_enable(spi->periph, SPI_DMA_TRANSMIT);

    return HAL_ERR_NONE;    
}



/*!
    \brief      SPI interrupt handler content function
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_spi_irq(hal_spi_dev_struct *spi)
{
    __IO uint32_t tmp = 0x00U;  
    
    if ((spi_i2s_interrupt_flag_get(spi->periph,SPI_I2S_INT_FLAG_TBE) != RESET)){
        
        spi->spi_irq.transmit_handler(spi);
        
    }
    if (((SPI_STAT(spi->periph) & SPI_STAT_RXORERR) == RESET)&&(spi_i2s_interrupt_flag_get(spi->periph,SPI_I2S_INT_FLAG_RBNE) != RESET)){
        
        spi->spi_irq.receive_handler(spi);
    }

    if ((((SPI_STAT(spi->periph) & (SPI_STAT_RXORERR | SPI_STAT_CONFERR | SPI_STAT_FERR))) != RESET) && ((SPI_CTL1(spi->periph) & SPI_CTL1_ERRIE) != RESET)){
        /* SPI overrun error interrupt occurred */
        if (spi_i2s_interrupt_flag_get(spi->periph,SPI_I2S_INT_FLAG_RXORERR) != RESET){
            _spi_clear_error_flag(spi->periph,SPI_ERROR_FLAG_RXORERR);
        }

        /* SPI mode error interrupt occurred */
        if (spi_i2s_interrupt_flag_get(spi->periph,SPI_INT_FLAG_CONFERR) != RESET){
            _spi_clear_error_flag(spi->periph,SPI_ERROR_FLAG_CONF);
        }

        /* SPI frame error interrupt occurred */
        if(spi_i2s_interrupt_flag_get(spi->periph,SPI_I2S_INT_FLAG_FERR) != RESET){
            _spi_clear_error_flag(spi->periph,SPI_ERROR_FLAG_FERR);
        }

        /* disable all interrupts */
        spi_i2s_interrupt_disable(spi->periph,SPI_I2S_INT_TBE);
        spi_i2s_interrupt_disable(spi->periph,SPI_I2S_INT_RBNE);
        spi_i2s_interrupt_disable(spi->periph,SPI_I2S_INT_ERR);
        spi->state = HAL_SPI_STATE_READY;

        /* disable the SPI DMA requests if enabled */
        hal_dma_stop(spi->p_dma_tx);
        hal_dma_stop(spi->p_dma_rx);
            
    }
}

/*!
    \brief      set user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: the structure that contains callback handlers of SPI interrupt
    \param[out] none
    \retval     none
*/
void hal_spi_irq_handle_set(hal_spi_dev_struct *spi, hal_spi_irq_struct *p_irq)
{
    if(NULL != p_irq->error_handler ){
        spi->spi_irq.error_handler = p_irq->error_handler;
        spi_i2s_interrupt_enable(spi->periph, SPI_I2S_INT_ERR);
    }else{
        spi->spi_irq.error_handler = NULL;
        spi_i2s_interrupt_disable(spi->periph, SPI_I2S_INT_ERR);
    }

    if(NULL != p_irq->receive_handler ){
        spi->spi_irq.receive_handler = p_irq->receive_handler;
        spi_i2s_interrupt_enable(spi->periph, SPI_I2S_INT_RBNE);
    }else{
        spi->spi_irq.receive_handler = NULL;
        spi_i2s_interrupt_disable(spi->periph, SPI_I2S_INT_RBNE);
    }
        
    if(NULL != p_irq->transmit_handler ){
        spi->spi_irq.transmit_handler = p_irq->transmit_handler;
        spi_i2s_interrupt_enable(spi->periph, SPI_I2S_INT_TBE);
    }else{
        spi->spi_irq.transmit_handler = NULL;
        spi_i2s_interrupt_disable(spi->periph, SPI_I2S_INT_TBE);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  spi: SPI device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_spi_irq_handle_all_reset(hal_spi_dev_struct *spi)
{
    spi->spi_irq.error_handler=NULL;
    spi->spi_irq.transmit_handler = NULL;
    spi->spi_irq.receive_handler =NULL;
    spi->spi_irq.transmit_receive_handler =NULL;
}

/*!
    \brief      enable SPI peripheral
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/void hal_spi_start(hal_spi_dev_struct *spi)
{
    spi_enable(spi->periph);
}
/*!
    \brief      disable SPI peripheral
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/void hal_spi_stop(hal_spi_dev_struct *spi)
{
    spi_disable(spi->periph);
}

/*!
    \brief      stop SPI DMA
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_spi_abort(hal_spi_dev_struct *spi)
{
    uint32_t tick_start = 0;
    int32_t errorcode;
    errorcode = HAL_ERR_NONE;
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == spi)){
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
