SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_spi.c
    if(SPI_CTL1(spi->periph) & SPI_CTL1_TBEIE){
        spi->spi_irq.transmit_handler = _spi_stop_transmit_interrupt;
        tick_start = hal_basetick_count_get();
        while(spi->state != HAL_SPI_ERROR_NONE){
            if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE){
                if(SET == hal_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)){
                    spi->error_code = HAL_SPI_ERROR_ABORT;
                    break;
                }
            }
        }
    }

    if(SPI_CTL1(spi->periph) & SPI_CTL1_RBNEIE){
        spi->spi_irq.receive_handler = _spi_stop_receive_interrupt;
        tick_start = hal_basetick_count_get();
        while(spi->state != HAL_SPI_ERROR_NONE){
            if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE){
                if(SET == hal_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)){
                    spi->error_code = HAL_SPI_ERROR_ABORT;
                    break;
                }
            }
        }
    }

    spi_i2s_interrupt_disable(spi->periph,SPI_I2S_INT_ERR);
    if ((SPI_CTL1(spi->periph)&SPI_CTL1_DMATEN )|| (SPI_CTL1(spi->periph)&SPI_CTL1_DMAREN )){
        if (spi->p_dma_tx != NULL){
            hal_dma_stop(spi->p_dma_tx);
                                 
            spi->error_code = HAL_SPI_ERROR_NONE;
            spi_dma_disable(spi->periph,SPI_DMA_TRANSMIT);
            if(HAL_ERR_NONE != _spi_end_transmit_receive(spi,SPI_TIMEOUT_VALUE)){
                 spi->error_code = HAL_SPI_ERROR_ABORT;
            }
            spi_disable(spi->periph);

            if(SPI1 == spi->periph){
                tick_start = hal_basetick_count_get();
                while(RESET == spi_i2s_flag_get(spi->periph,SPI_RXLVL_EMPTY)){
                    if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE){
                        if(SET == hal_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)){
                                spi->error_code = HAL_SPI_ERROR_ABORT;
                        }
                    }
                }
            }
        }
        if(spi->p_dma_rx != NULL){
            hal_dma_stop(spi->p_dma_rx);
            
            spi->error_code = HAL_SPI_ERROR_ABORT;
            spi_disable(spi->periph);

            tick_start = hal_basetick_count_get();
            while(RESET != spi_i2s_flag_get(spi->periph, SPI_FLAG_TRANS)){
                if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE){
                    if(SET == hal_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)){
                        spi->error_code = HAL_SPI_ERROR_ABORT;
                    }
                }
            }

            if(SPI1 == spi->periph){
                tick_start = hal_basetick_count_get();
                while(RESET == spi_i2s_flag_get(spi->periph, SPI_RXLVL_EMPTY)){
                    if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE){
                        if(SET == hal_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)){
                            spi->error_code = HAL_SPI_ERROR_ABORT;
                        }
                    }
                }
            }
            spi_dma_disable(spi->periph,SPI_DMA_RECEIVE);
        }
    }
    spi->rxbuffer.pos = 0U;
    spi->txbuffer.pos = 0U;

    if (HAL_SPI_ERROR_ABORT == spi->error_code){
        errorcode = HAL_ERR_NONE ;
    }else{
        spi->error_code = HAL_SPI_ERROR_NONE;
    }

    /* clear the rx overrun error flag */
    _spi_clear_error_flag(spi->periph,SPI_ERROR_FLAG_RXORERR);
    
    spi->state = HAL_SPI_STATE_READY;

    return errorcode;
}

/*!
    \brief      stop SPI DMA
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_spi_dma_pause(hal_spi_dev_struct *spi)
{
    spi_dma_disable(spi->periph,SPI_DMA_TRANSMIT);
    spi_dma_disable(spi->periph,SPI_DMA_RECEIVE);
}

/*!
    \brief      stop SPI DMA
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_spi_dma_resume(hal_spi_dev_struct *spi)
{
    spi_dma_enable(spi->periph,SPI_DMA_TRANSMIT);
    spi_dma_enable(spi->periph,SPI_DMA_RECEIVE);
}

/*!
    \brief      stop SPI DMA
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_spi_dma_stop(hal_spi_dev_struct *spi)
{
    if(NULL!= spi->p_dma_rx){
        hal_dma_stop(spi->p_dma_rx);
    }
    if (NULL != spi->p_dma_tx){
        hal_dma_stop(spi->p_dma_tx);
    }

    spi_dma_disable(spi->periph,SPI_DMA_TRANSMIT);
    spi_dma_disable(spi->periph,SPI_DMA_RECEIVE);
    spi->state = HAL_SPI_STATE_READY;
}

/*!
    \brief      SPI 8 bit transmit interrupt  handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_transmit_interrupt(void *spi)
{
    hal_spi_dev_struct *p_spi = spi;
    if ((__HAL_SPI_GET_SPI1_FRAME_SIZE(p_spi->periph) > SPI_FRAMESIZE_8BIT) || ((__HAL_SPI_GET_SPI0_FRAME_SIZE(p_spi->periph) == 0x00000800))){
        SPI_DATA(p_spi->periph)= *((uint16_t *)p_spi->txbuffer.buffer);
        p_spi->txbuffer.buffer += sizeof(uint16_t);
        p_spi->txbuffer.pos--;
    }else{
        if(SPI0 == p_spi->periph){
            spi_i2s_data_transmit(p_spi->periph, *p_spi->txbuffer.buffer++);
            p_spi->txbuffer.pos--;
        }
        if(SPI1 == p_spi->periph){
            SPI_CTL1(p_spi->periph) |= SPI_CTL1_BYTEN;
            SPI_DATA(p_spi->periph) = (*p_spi->txbuffer.buffer++);
            p_spi->txbuffer.pos--;
        }

