SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_spi.c
    }
    
    if (0U == p_spi->txbuffer.pos){
        if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)){
            spi_crc_next(p_spi->periph);
        }
        _spi_close_transmit_interrupt(p_spi); 
    }
}

/*!
    \brief      SPI receive interrupt  handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_receive_interrupt(void *spi)
{
     hal_spi_dev_struct *p_spi = spi;

    if ((__HAL_SPI_GET_SPI1_FRAME_SIZE(p_spi->periph) > SPI_FRAMESIZE_8BIT) || ((__HAL_SPI_GET_SPI0_FRAME_SIZE(p_spi->periph) == 0x00000800))){
        *((uint16_t *)p_spi->rxbuffer.buffer) = SPI_DATA(p_spi->periph);
        p_spi->rxbuffer.buffer += sizeof(uint16_t);
        p_spi->rxbuffer.pos--;
    }else
    {
        if(SPI0 == p_spi->periph){
            *p_spi->rxbuffer.buffer++ = SPI_DATA(p_spi->periph);
             p_spi->rxbuffer.pos--;   
        }
        if(SPI1 == p_spi->periph){
            SPI_CTL1(p_spi->periph) |= SPI_CTL1_BYTEN;
            (*p_spi->rxbuffer.buffer++) = SPI_DATA(p_spi->periph);
            p_spi->rxbuffer.pos--;
        }
        
    } 
    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)&&(1U == p_spi->rxbuffer.pos)){
        spi_crc_next(p_spi->periph);
    }

    if (0U == p_spi->rxbuffer.pos){
        if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)){
            __IO uint32_t tmp =0;
            tmp = SPI_DATA(p_spi->periph);
        }
        _spi_close_receive_interrupt(p_spi); 
    }
}

/*!
    \brief      SPI 8 bit 2 lines receive interrupt handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_2lines_receive_interrupt(void *spi)
{
    hal_spi_dev_struct *p_spi = spi;

    if ((__HAL_SPI_GET_SPI1_FRAME_SIZE(p_spi->periph) > SPI_FRAMESIZE_8BIT) || ((__HAL_SPI_GET_SPI0_FRAME_SIZE(p_spi->periph) == 0x00000800))){
        
        *((uint16_t *)p_spi->rxbuffer.buffer) = spi_i2s_data_receive(p_spi->periph);
        p_spi->rxbuffer.buffer += sizeof(uint16_t);
        p_spi->rxbuffer.pos--;
        
    }else{/* receive data in 8 bit mode */

        if(SPI0 == p_spi->periph){
            *p_spi->rxbuffer.buffer++ = *((__IO uint8_t *)&SPI_DATA(p_spi->periph));
             p_spi->rxbuffer.pos--;   
        }
        if(SPI1 == p_spi->periph){
            if (p_spi->rxbuffer.pos > 1U){
                SPI_CTL1(p_spi->periph) &= ~SPI_CTL1_BYTEN;
                /* packing mode */
                *((uint16_t *)p_spi->rxbuffer.buffer) = SPI_DATA(p_spi->periph);
                p_spi->rxbuffer.buffer += sizeof(uint16_t);
                p_spi->rxbuffer.pos -= 2U;
                if(1 == p_spi->rxbuffer.pos){
                    SPI_CTL1(p_spi->periph) |= SPI_CTL1_BYTEN;
                }
            }else{
                SPI_CTL1(p_spi->periph) |= SPI_CTL1_BYTEN;
                (*p_spi->rxbuffer.buffer++) = SPI_DATA(p_spi->periph);
                p_spi->rxbuffer.pos--;
                SPI_CTL1(p_spi->periph) &= ~SPI_CTL1_BYTEN;
            }
        }
    }
    
    if (0U == p_spi->rxbuffer.pos){
        if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)){
            __IO uint32_t tmp =0;
            tmp = SPI_DATA(p_spi->periph);
        }
        /* disable RBNE and ERR interrupt */
        spi_i2s_interrupt_disable(p_spi->periph,SPI_I2S_INT_RBNE);
        spi_i2s_interrupt_disable(p_spi->periph,SPI_I2S_INT_ERR);
        if (0U == p_spi->txbuffer.pos){
            _spi_close_transmit_receive_interrupt(p_spi); 
        }
    }

}

/*!
    \brief      SPI 8 bit 2 lines transmit interrupt handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_2lines_transmit_interrupt(void *spi)
{
    hal_spi_dev_struct *p_spi = spi;

    if ((__HAL_SPI_GET_SPI1_FRAME_SIZE(p_spi->periph) > SPI_FRAMESIZE_8BIT) || ((__HAL_SPI_GET_SPI0_FRAME_SIZE(p_spi->periph) == 0x00000800))){

            SPI_DATA(p_spi->periph) = *((uint16_t *)p_spi->txbuffer.buffer);
            p_spi->txbuffer.buffer += sizeof(uint16_t);
            p_spi->txbuffer.pos--;

    }else{/* transmit data in 8 bit mode */
        
        if(SPI0 == p_spi->periph){
            spi_i2s_data_transmit(p_spi->periph, *p_spi->txbuffer.buffer++);
            p_spi->txbuffer.pos--;
        }
        /* transmit data in packing mode */
        if(SPI1 == p_spi->periph){
            if(p_spi->txbuffer.pos > 1U){
                SPI_CTL1(p_spi->periph) &= ~SPI_CTL1_BYTEN;
                SPI_DATA(p_spi->periph) =  *((uint16_t *)p_spi->txbuffer.buffer);
                p_spi->txbuffer.buffer += sizeof(uint16_t);
                p_spi->txbuffer.pos -= 2U;
                if (1U == p_spi->rxbuffer.pos){
                    SPI_CTL1(p_spi->periph) |= SPI_CTL1_BYTEN;
                }
                
            }else{
                SPI_CTL1(p_spi->periph) |= SPI_CTL1_BYTEN;
                SPI_DATA(p_spi->periph) = (*p_spi->txbuffer.buffer++);
                p_spi->txbuffer.pos--;
            }
        }
        
    }
    
    /* check end of the reception */
    if (0U == p_spi->txbuffer.pos){
        if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)){
            spi_crc_next(p_spi->periph);
            spi_i2s_interrupt_disable(p_spi->periph,SPI_I2S_INT_TBE);
            return;
        }
        /* disable RBNE and ERR interrupt */
        spi_i2s_interrupt_disable(p_spi->periph,SPI_I2S_INT_TBE);

