SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_spi.c
        if (0U == p_spi->rxbuffer.pos){
            _spi_close_transmit_receive_interrupt(p_spi); 
        }
    }
}

/*!
    \brief      SPI DMA transmit handler
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _spi_transmit_compelete_dma(void *dma)
{
    hal_spi_user_cb p_func = NULL;
    hal_spi_user_cb p_func_err = NULL;
    
    hal_dma_dev_struct *p_dma;
    hal_spi_dev_struct *p_spi;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_spi = (hal_spi_dev_struct*)p_dma->p_periph;
    p_func = (hal_spi_user_cb)p_spi->tx_callback;
    p_func_err= (hal_spi_user_cb)p_spi->error_callback;

    /* DMA normal Mode */
    if(SET != (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN )){
        /* disable ERR interrupt */
        spi_i2s_interrupt_disable(p_spi->periph,SPI_I2S_INT_ERR);
        /* disable Tx DMA Request */
        spi_dma_disable(p_spi->periph,SPI_DMA_TRANSMIT);

        /* check the end of the transaction */
        if (HAL_ERR_NONE != _spi_end_transmit_receive(p_spi, SPI_TIMEOUT_VALUE)){
            p_spi->error_code = HAL_SPI_ERROR_TIMEOUT;
        }

        /* clear overrun flag in 2 Lines communication mode because received data is not read */
        if (SPI_TRANSMODE_FULLDUPLEX == __HAL_SPI_GET_DEVICE_MODE(p_spi->periph)){
            if(SET == spi_i2s_flag_get(p_spi->periph,SPI_FLAG_RXORERR)){
                _spi_clear_error_flag(p_spi->periph,SPI_ERROR_FLAG_RXORERR);
                p_spi->error_code = HAL_SPI_ERROR_CRC;
            }
        }

        p_spi->txbuffer.pos = 0U;
        p_spi->state = HAL_SPI_STATE_READY;

        if (p_spi->error_code != HAL_ERR_NONE){
            if(NULL != p_func_err){
                p_func_err(p_spi);
                return;
            }
        }
    }
    if(NULL != p_func){
        p_func(p_spi);
    }

}

/*!
    \brief      SPI DMA receive handler
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _spi_receive_compelete_dma(void *dma)
{
    __IO uint16_t tmpcrc = 0U;
    hal_spi_user_cb p_func = NULL;
    hal_spi_user_cb p_func_err = NULL;
    
    hal_dma_dev_struct *p_dma;
    hal_spi_dev_struct *p_spi;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_spi = (hal_spi_dev_struct*)p_dma->p_periph;
    p_func = (hal_spi_user_cb)p_spi->rx_callback;
    p_func_err= (hal_spi_user_cb)p_spi->error_callback;
    
    /* DMA Normal Mode */
    if(SET != (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN )){
        /* Disable ERR interrupt */
        spi_i2s_interrupt_disable(p_spi->periph,SPI_I2S_INT_ERR);
        /* disable Rx/Tx DMA Request */
        spi_dma_disable(p_spi->periph,SPI_DMA_TRANSMIT);
        spi_dma_disable(p_spi->periph,SPI_DMA_RECEIVE);
        if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)){
            tmpcrc = SPI_DATA(p_spi->periph);
        }



        /* check the end of the transaction */
        if (_spi_end_receive(p_spi, 200) != HAL_ERR_NONE){
            p_spi->error_code = HAL_SPI_ERROR_TIMEOUT;
        }
        
        p_spi->rxbuffer.pos = 0U;
        p_spi->state = HAL_SPI_STATE_READY;

        if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)){
            if(SET == spi_i2s_flag_get(p_spi->periph,SPI_FLAG_CRCERR)){
                _spi_clear_error_flag(p_spi->periph,SPI_ERROR_FLAG_CRCERR);
                p_spi->error_code = HAL_SPI_ERROR_CRC;
            }
        }
        
        if (p_spi->error_code != HAL_ERR_NONE){
            if(NULL != p_func_err){
                p_func_err(p_spi);
                return;
            }
        }
    }
    if(NULL != p_func){
        p_func(p_spi);
    }
}

/*!
    \brief      SPI DMA transmit and receive handler
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _spi_transmit_receive_compelete_dma(void *dma)
{
    uint32_t tick_start = 0;
    __IO uint16_t tmpcrc = 0U;
    hal_spi_user_cb p_func = NULL;
    hal_spi_user_cb p_func_err = NULL;
    
    hal_dma_dev_struct *p_dma;
    hal_spi_dev_struct *p_spi;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_spi = (hal_spi_dev_struct*)p_dma->p_periph;
    p_func = (hal_spi_user_cb)p_spi->tx_rx_callback;
    p_func_err= (hal_spi_user_cb)p_spi->error_callback;
    
    /* DMA normal mode */
    if(SET != (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)){
        /* disable ERR interrupt */
        spi_i2s_interrupt_disable(p_spi->periph,SPI_I2S_INT_ERR);
        
        if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(p_spi->periph)){

            if(SPI1 == p_spi->periph){
                if((__HAL_SPI_GET_SPI1_CRC_LENGTH(p_spi->periph) == SPI_CRC_8BIT) &&(__HAL_SPI_GET_SPI1_FRAME_SIZE(p_spi->periph) > SPI_FRAMESIZE_8BIT)){
                    tick_start = hal_basetick_count_get();
                    while(RESET == spi_i2s_flag_get(p_spi->periph, SPI_RXLVL_QUARTER_FULL)){
                        if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE){
                            if(SET == hal_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)){
                                spi_crc_off(p_spi->periph);
                                spi_crc_on(p_spi->periph);
                                break;
                            }
                        }
                    }
                    tmpcrc = *(__IO uint8_t *)&SPI_DATA(p_spi->periph);
                }else{
                    tick_start = hal_basetick_count_get();
                    while(RESET != spi_i2s_flag_get(p_spi->periph, SPI_RXLVL_HAlF_FULL)){
                        if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE){
                            if(SET == hal_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)){
                                spi_crc_off(p_spi->periph);
                                spi_crc_on(p_spi->periph);
                                break;
                            }
                        }
                    }
                    tmpcrc = SPI_DATA(p_spi->periph);
                }
            }
            if(SPI0 == p_spi->periph){
                tick_start = hal_basetick_count_get();
                while(RESET == spi_i2s_flag_get(p_spi->periph, SPI_FLAG_RBNE)){
                    if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE){
                        if(SET == hal_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)){
                            spi_crc_off(p_spi->periph);
                            spi_crc_on(p_spi->periph);
                            break;
                        }
                    }
                }
                tmpcrc = SPI_DATA(p_spi->periph);
            }
        }
        
        /* check the end of the transaction */
        if (_spi_end_transmit_receive(p_spi, SPI_TIMEOUT_VALUE) != HAL_ERR_NONE){
            p_spi->error_code = HAL_SPI_ERROR_TIMEOUT;
        }

        /* disable Rx and Tx DMA */
        spi_dma_disable(p_spi->periph,SPI_DMA_TRANSMIT);
        spi_dma_disable(p_spi->periph,SPI_DMA_RECEIVE);

