SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_spi.c
        p_spi->rxbuffer.pos = 0U;
        p_spi->txbuffer.pos = 0U;
        p_spi->state = HAL_SPI_STATE_READY;
        
        if (p_spi->error_code != HAL_ERR_NONE){
            if(NULL != p_func_err){
                p_func_err(p_spi);
                return;
            }
        }
    }
    if(NULL != p_func){
        p_func(p_spi);
    }
    
}

/*!
    \brief      SPI DMA error handler
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _spi_dma_error(void *dma)
{
    hal_spi_user_cb p_func_err = NULL;
    
    hal_dma_dev_struct *p_dma;
    hal_spi_dev_struct *p_spi;
        
    p_dma = (hal_dma_dev_struct*)dma;
    p_spi = (hal_spi_dev_struct*)p_dma->p_periph;
    p_func_err= (hal_spi_user_cb)p_spi->error_callback;

    spi_dma_disable(p_spi->periph,SPI_DMA_RECEIVE);
    spi_dma_disable(p_spi->periph,SPI_DMA_TRANSMIT);

    p_spi->error_code = HAL_SPI_ERROR_DMA;
    p_spi->state = HAL_SPI_STATE_READY;
    
    if(NULL != p_func_err){
        p_func_err(p_spi);
    }
}

/*!
    \brief      SPI stop receive  interrupt handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_stop_receive_interrupt(void *spi)
{
    uint32_t tick_start = 0;
    hal_spi_dev_struct *p_spi = spi;
    /* disable SPI Peripheral */
    spi_disable(p_spi->periph);

    /* disable TBEIE, RBNEIE and ERRIE interrupts */
    spi_i2s_interrupt_disable(p_spi->periph,SPI_I2S_INT_TBE);
    spi_i2s_interrupt_disable(p_spi->periph,SPI_I2S_INT_RBNE);
    spi_i2s_interrupt_disable(p_spi->periph,SPI_I2S_INT_ERR);

    /* check RBNEIE is diabled */
    tick_start = hal_basetick_count_get();
    while((SPI_CTL1(p_spi->periph) & SPI_CTL1_RBNEIE)){
        if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE){
            if(SET == hal_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)){
                p_spi->error_code = HAL_SPI_ERROR_ABORT;
            }
        }
    }

    tick_start = hal_basetick_count_get();
    while(RESET != spi_i2s_flag_get(p_spi->periph,SPI_FLAG_TRANS)){
        if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE){
            if(SET == hal_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)){
                p_spi->error_code = HAL_SPI_ERROR_ABORT;
            }
        }
    }
    if(SPI1 == p_spi->periph){
        tick_start = hal_basetick_count_get();
        while(RESET == spi_i2s_flag_get(p_spi->periph,SPI_TXLVL_EMPTY)){
            if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE){
                if(SET == hal_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)){
                    p_spi->error_code = HAL_SPI_ERROR_ABORT;
                }
            }
        }
    }
    p_spi->state = HAL_SPI_STATE_ABORT;
}

/*!
    \brief      SPI stop transmit interrupt handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_stop_transmit_interrupt(void *spi)
{
    uint32_t tick_start = 0;
    hal_spi_dev_struct *p_spi = spi;

    /* disable TBEIE, ERRIE(mode fault event, overrun error, TI frame error) interrupts */
    spi_i2s_interrupt_disable(p_spi->periph,SPI_I2S_INT_TBE);
    spi_i2s_interrupt_disable(p_spi->periph,SPI_I2S_INT_ERR);
    if(SPI1 == p_spi->periph){
        tick_start = hal_basetick_count_get();
        while((SPI_CTL1(p_spi->periph) & SPI_CTL1_RBNEIE)){
            if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE){
                if(SET == hal_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)){
                    p_spi->error_code = HAL_SPI_ERROR_ABORT;
                }
            }
        }
        
        if(HAL_ERR_NONE != _spi_end_transmit_receive(p_spi,SPI_TIMEOUT_VALUE)){
            p_spi->error_code = HAL_SPI_ERROR_ABORT;
        }

        tick_start = hal_basetick_count_get();
        while(RESET == spi_i2s_flag_get(p_spi->periph,SPI_RXLVL_EMPTY)){
            if(HAL_TIMEOUT_FOREVER != SPI_TIMEOUT_VALUE){
                if(SET == hal_basetick_timeout_check(tick_start, SPI_TIMEOUT_VALUE)){
                    p_spi->error_code = HAL_SPI_ERROR_ABORT;
                }
            }
        }

        p_spi->state = HAL_SPI_STATE_ABORT;
    } 
    /* disable SPI peripheral */
    spi_disable(p_spi->periph);
}

/*!
    \brief      SPI close transmit and  receive interrupt handler
    \param[in]  spi: SPI device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _spi_close_transmit_receive_interrupt(hal_spi_dev_struct *spi)
{
    hal_spi_user_cb p_func = NULL;
    
    /* disable ERR interrupt */
    spi_i2s_interrupt_disable(spi->periph, SPI_I2S_INT_ERR);
    /* check the end of the transaction */
    if (_spi_end_transmit_receive(spi, SPI_TIMEOUT_VALUE) != HAL_ERR_NONE){
        spi->error_code = HAL_SPI_ERROR_TIMEOUT;
    }
    if(SPI_CRC_ENABLE == __HAL_SPI_GET_CRC_USED(spi->periph)){
        if(RESET != spi_i2s_flag_get(spi->periph,SPI_FLAG_CRCERR)){
            spi_crc_error_clear(spi->periph);
            p_func = (hal_spi_user_cb)spi->error_callback;
            if(NULL != p_func){
                p_func(spi);
            }
            return;
        }
    }
    if(HAL_ERR_NONE == spi->error_code){
        if (HAL_SPI_STATE_BUSY_RX == spi->state){
            spi->state = HAL_SPI_STATE_READY;
            p_func = (hal_spi_user_cb)spi->tx_callback;
            if(NULL != p_func){
                p_func(spi);
            }
        }else{
            spi->state = HAL_SPI_STATE_READY;
            p_func = (hal_spi_user_cb)spi->tx_rx_callback;
            if(NULL != p_func){
                p_func(spi);
            }
        }
    }else{
        spi->state = HAL_SPI_STATE_READY;
        p_func = (hal_spi_user_cb)spi->error_callback;
        if(NULL != p_func){
            p_func(spi);
        }
    }
 
