SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_spi.c
    /* check if the receive fifo is empty */
    if(SPI1 == spi->periph){
        if ((SPI_MASTER == __HAL_SPI_GET_DEVICE_MODE(spi->periph)) && (SPI_TRANSMODE_FULLDUPLEX != __HAL_SPI_GET_DEVICE_MODE(spi->periph))){
            tick_start = hal_basetick_count_get();
            while(RESET == spi_i2s_flag_get(spi->periph,SPI_RXLVL_EMPTY)){
                if(HAL_TIMEOUT_FOREVER != timeout_ms){
                    if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                        return HAL_ERR_TIMEOUT;
                    }
                }
            }
        }
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      check SPI transmit and receive end
    \param[in]  periph: SPIx(x=0,1)
    \param[in]  error_flag: error flag
                only one parameter can be selected which is shown as below:
      \arg        SPI_ERROR_FLAG_CONF: SPI configuration error 
      \arg        SPI_ERROR_FLAG_FERR: SPI format error
      \arg        SPI_ERROR_FLAG_CRCERR: SPI CRC error
      \arg        SPI_ERROR_FLAG_RXORERR: SPI reception overrun error
    \param[out] none
    \retval     none
*/
static void _spi_clear_error_flag(uint32_t periph ,uint32_t error_flag)
{
    __IO uint32_t temp = 0;
    switch(error_flag){
    case SPI_ERROR_FLAG_CONF:
        temp = SPI_STAT(periph);
        SPI_CTL0(periph) &= (uint32_t)(~SPI_CTL0_SPIEN);
         break;
    case SPI_ERROR_FLAG_RXORERR:
        temp = SPI_DATA(periph);
        temp = SPI_STAT(periph);
        break;
    case SPI_ERROR_FLAG_FERR:
        temp = SPI_STAT(periph);
        break;
    case SPI_ERROR_FLAG_CRCERR:
        SPI_STAT(periph) &= (uint32_t)(~SPI_FLAG_CRCERR);
        break;
    default:
        break;
    }
}
